app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    if @project.save
---
INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "TextMate 2"], ["description", "A text-editor for OS X"], ["created_at", "2016-05-03 22:50:24.167988"], ["updated_at", "2016-05-03 22:50:24.167988"]]